import matplotlib.pyplot as plt

# # Значения x и y
# x = [255, 1000, 5000, 10000, 25000, 35000, 45000, 60000]
# y = [8409210, 9666360, 8519059, 7936130, 7196241, 6964148, 6800435, 6624621]
# y = [10_000_000 / i for i in y]

x = [100, 1000, 5_000, 10_000, 25_000, 50_000, 75_000, 100_000, 250_000, 350_000, 500_000, 750_000, 1_000_000]
y = [10210071, 8534070, 7640065, 7335950, 6974394, 6733178, 6613673, 6519259, 6287620, 6206320, 6124394, 6034573,
     5967450]

y = [10_000_000 / i for i in y]

# Построение графика
plt.plot(x, y, marker='o', linestyle='-')

# Добавление заголовка и меток осей
plt.title('BWT+RLE')
plt.xlabel('N size')
plt.ylabel('compress ratio')

# Отображение графика
plt.grid(True)
plt.show()
